import classes from './ArticleContext.module.css';
import ArticleTrending from '../ArticleTrending/ArticleTrending';
import ArticleRelated from '../ArticleRelated/ArticleRelated';
import article4 from './img/article4.jpg';

const ArticleContext = () => {
    return (
        <main className={classes['article--context']}>
            <div className={classes['article--context__detail']}>
                <p>
                    動漫對我來說，已經成為了我生活的一部分。博蒙特與弗萊徹曾經認為，陳舊的款式一般不會有新穎之處，也不會有人仿效;
                    然而，我們知道，二十年前流行過的款式還會重新受到人們的喜愛。這啟發了我。需要考慮周詳動漫的影響及因應對策。馬克思說過一句發人省思的話，社會為生產小麥，家畜等等所需要的時間越少，它對其它生產，不論是物質的生產或精神的生產所獲得時間便越多。這似乎解答了我的疑惑。高爾基曾經提過，世界上最快而又最慢，最長而又最短，最平凡而又最珍貴，最容易被人忽視，而又最令人後悔的就是時間。這句話語雖然很短，但令我浮想聯翩。那麼，經過上述討論，動漫的出現，必將帶領人類走向更高的巔峰。其實，若思緒夠清晰，那麼動漫也就不那麼複雜了。就我個人來說，動漫對我的意義，不能不說非常重大。我們一般認為，抓住了問題的關鍵，其他一切則會迎刃而解。在這種不可避免的衝突下，我們必須解決這個問題。馬格說過一句著名的話，劍就是我們的雄辯家。這句話看似簡單，卻埋藏了深遠的意義。如果仔細思考動漫，會發現其中蘊含的深遠意義。卡萊爾說過一句很有意思的話，任何一項勞動都是崇高的，崇高的事業只有勞動。這似乎解答了我的疑惑。帶著這些問題，我們一起來審視動漫。這樣看來，周恩來說過，願相會於中華騰飛世界時。這句話令我不禁感慨問題的迫切性。面對如此難題，我們必須設想周全。不難發現，問題在於該用什麼標準來做決定呢？若到今天結束時我們都還無法釐清動漫的意義，那想必我們昨天也無法釐清。動漫必定會成為未來世界的新標準。對動漫進行深入研究，在現今時代已經無法避免了。
                    皮塔庫斯曾講過，要認准自己的機會。但願諸位理解後能從中有所成長。動漫因何而發生？謹慎地來說，我們必須考慮到所有可能。柏拉圖說過一句很有意思的話，不知道自己的無知，乃是雙倍的無知。這把視野帶到了全新的高度。當你搞懂後就會明白了。我們要學會站在別人的角度思考。彌爾頓曾說過一句意義深遠的話，歌與詩是對天生和諧的姐妹。這是撼動人心的。話雖如此，我們卻也不能夠這麼篤定。一般來講，我們都必須務必慎重的考慮考慮。
                    這是不可避免的。了解清楚動漫到底是一種怎麼樣的存在，是解決一切問題的關鍵。不要先入為主覺得動漫很複雜，實際上，動漫可能比你想的還要更複雜。動機，可以說是最單純的力量。總而言之，恩格斯講過一句值得人反覆尋思的話，只有在不僅消滅了階級對立，而且在實際生活中也忘卻了這種對立的社會發展階段上，超越階級對立和超越這種對立的回憶的、真正人的道德才成為可能。這段話的餘韻不斷在我腦海中迴盪著。鄧中夏講過一段深奧的話，看呀！世界不是勞動的藝術品嗎？沒有勞動就沒有世界。這段話的餘韻不斷在我腦海中迴盪著。
                </p>
                <img src={article4} alt=""></img>
                <p>
                    這是不可避免的。了解清楚動漫到底是一種怎麼樣的存在，是解決一切問題的關鍵。不要先入為主覺得動漫很複雜，實際上，動漫可能比你想的還要更複雜。動機，可以說是最單純的力量。總而言之，恩格斯講過一句值得人反覆尋思的話，只有在不僅消滅了階級對立，而且在實際生活中也忘卻了這種對立的社會發展階段上，超越階級對立和超越這種對立的回憶的、真正人的道德才成為可能。這段話的餘韻不斷在我腦海中迴盪著。鄧中夏講過一段深奧的話，看呀！世界不是勞動的藝術品嗎？沒有勞動就沒有世界。這段話的餘韻不斷在我腦海中迴盪著。
                    這是不可避免的。了解清楚動漫到底是一種怎麼樣的存在，是解決一切問題的關鍵。不要先入為主覺得動漫很複雜，實際上，動漫可能比你想的還要更複雜。動機，可以說是最單純的力量。總而言之，恩格斯講過一句值得人反覆尋思的話，只有在不僅消滅了階級對立，而且在實際生活中也忘卻了這種對立的社會發展階段上，超越階級對立和超越這種對立的回憶的、真正人的道德才成為可能。這段話的餘韻不斷在我腦海中迴盪著。鄧中夏講過一段深奧的話，看呀！世界不是勞動的藝術品嗎？沒有勞動就沒有世界。這段話的餘韻不斷在我腦海中迴盪著。
                    這是不可避免的。了解清楚動漫到底是一種怎麼樣的存在，是解決一切問題的關鍵。不要先入為主覺得動漫很複雜，實際上，動漫可能比你想的還要更複雜。動機，可以說是最單純的力量。總而言之，恩格斯講過一句值得人反覆尋思的話，只有在不僅消滅了階級對立，而且在實際生活中也忘卻了這種對立的社會發展階段上，超越階級對立和超越這種對立的回憶的、真正人的道德才成為可能。這段話的餘韻不斷在我腦海中迴盪著。鄧中夏講過一段深奧的話，看呀！世界不是勞動的藝術品嗎？沒有勞動就沒有世界。這段話的餘韻不斷在我腦海中迴盪著。
                </p>
            </div>
            <div className={classes['article--context__trending-related']}>
                <div>
                    <ArticleTrending />
                    <ArticleRelated />
                </div>
            </div>
        </main>
    );
};

export default ArticleContext;
